Revit 2027 API
ParameterTypeId.CouplerMainEngagement Property
 "Bar Engagement 1"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId CouplerMainEngagement { get; }
Public Shared ReadOnly Property CouplerMainEngagement As ForgeTypeId
	Get
public:
static property ForgeTypeId^ CouplerMainEngagement {
	ForgeTypeId^ get ();
}
static member CouplerMainEngagement : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace